<?php

/**
 * 念念不忘　　必有回响
 * 每一处地方的精心打磨
 * 都只为离完美更进一步
 *
 * @package Echo Theme
 * @author 宁采陈
 * @version 3.1
 * @link https://www.ncc.wang
 *
 * ｅｅｅｅｅｅｅ　　　　　　　　　　　ｅｅｅ　　　　　　　　　　　　　　　　　　　　
 * ｅｅｅｅｅｅｅ　　　　　　　　　　　ｅｅｅ　　　　　　　　　　　　　　　　　　　　
 * ｅｅｅｅ　　　　　　　ｅｅｅｅｅｅ　ｅｅｅｅｅｅｅ　　　　ｅｅｅｅｅｅ　
 * ｅｅｅｅ　　　　　　ｅｅｅｅｅｅｅ　ｅｅｅｅｅｅｅ　　　ｅｅｅｅｅｅｅｅ
 * ｅｅｅｅｅｅｅ　　　ｅｅｅｅｅｅｅ　ｅｅｅｅｅｅｅｅ　 ｅｅｅｅｅｅｅｅｅ
 * ｅｅｅｅｅｅｅ　　ｅｅｅｅ　　　　　ｅｅｅ　ｅｅｅｅ　 ｅｅｅ　　　ｅｅｅ　　　
 * ｅｅｅｅ　　　　　ｅｅｅｅ　　　　　ｅｅｅ　　ｅｅｅ　 ｅｅｅ　　　ｅｅｅ　　　
 * ｅｅｅｅ　　　　　　ｅｅｅｅ　　ｅ　ｅｅｅ　　ｅｅｅ　 ｅｅｅ　　　ｅｅｅ　　　
 * ｅｅｅｅｅｅｅｅ　　ｅｅｅｅｅｅｅ　ｅｅｅ　　ｅｅｅ　　ｅｅｅｅｅｅｅｅ　　　
 * ｅｅｅｅｅｅｅｅ　　　ｅｅｅｅｅｅ　ｅｅｅ　　ｅｅｅ　　　ｅｅｅｅｅｅ　　　
 */

if (!defined('__TYPECHO_ROOT_DIR__')) exit;

$this->need('usr/themes/router.php');
